<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"s3","backend":"3b08256b90106e50ba9cc5ffe722dd91a089424fabab44359ffbbfa881930ad9","plan_job_ref":"Job Infrastructure #485 at https://github.com/coverage-robot/core/actions/runs/11086331968","plan_out_hash":"dd0863c71751ed3b60598e7a96f743e304e17bb0a3a89b183702e70077074983","plan_hash":"62763d5dbb1c9c91a4bc4da793da7086ad16facb035abdf351a1c90c5f7b5fa2","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __./infrastructure__ in the __prod__ workspace
With var files: `./infrastructure/prod.tfvars`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.bucket.aws_s3_bucket.service_object_references will be created
+   resource "aws_s3_bucket" "service_object_references" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "coverage-object-reference-prod"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "environment" = "prod"
        }
+       tags_all                    = {
+           "environment" = "prod"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
!~  line_coverage_table       = {
        id                          = "projects/coverage-384615/datasets/prod/tables/line_coverage"
!~      last_modified_time          = 1726786694776 -> 1727544783061
!~      num_bytes                   = 3479695111899 -> 3546420977883
!~      num_long_term_bytes         = 2797860499199 -> 2850551860112
!~      num_rows                    = 7957525992 -> 8109147464
#        (28 unchanged attributes hidden)
    }
+   object_reference_bucket   = {
+       acceleration_status                  = (known after apply)
+       acl                                  = (known after apply)
+       arn                                  = (known after apply)
+       bucket                               = "coverage-object-reference-prod"
+       bucket_domain_name                   = (known after apply)
+       bucket_prefix                        = (known after apply)
+       bucket_regional_domain_name          = (known after apply)
+       cors_rule                            = (known after apply)
+       force_destroy                        = false
+       grant                                = (known after apply)
+       hosted_zone_id                       = (known after apply)
+       id                                   = (known after apply)
+       lifecycle_rule                       = (known after apply)
+       logging                              = (known after apply)
+       object_lock_configuration            = (known after apply)
+       object_lock_enabled                  = (known after apply)
+       policy                               = (known after apply)
+       region                               = (known after apply)
+       replication_configuration            = (known after apply)
+       request_payer                        = (known after apply)
+       server_side_encryption_configuration = (known after apply)
+       tags                                 = {
+           environment = "prod"
        }
+       tags_all                             = {
+           environment = "prod"
        }
+       timeouts                             = null
+       versioning                           = (known after apply)
+       website                              = (known after apply)
+       website_domain                       = (known after apply)
+       website_endpoint                     = (known after apply)
    }
!~  upload_table              = {
        id                          = "projects/coverage-384615/datasets/prod/tables/upload"
!~      last_modified_time          = 1726784857200 -> 1727547268080
!~      num_bytes                   = 26515184 -> 27042356
!~      num_rows                    = 98599 -> 100597
#        (29 unchanged attributes hidden)
    }
```
</details>

:memo: Plan generated in [Infrastructure #485](https://github.com/coverage-robot/core/actions/runs/11086331968)